# Mysql For Data Analytics Exploratory Data Analysis
## Analyst Builder
### Shane Boyce
### 2024-09-24

In this project, data from the World Life Expectancy dataset provided by Analyst Builder will be analyzed. The data was already loaded and cleaned in a script called `wle-clean.sql` that was called in bash via `./mysqlda.shh`. The `readme.md` file has instructions for the setup of the database and the data cleaning script. This notebook was completed in DataSpell and data will be queried in MySQL cells directly. This may not work in your local Jupyter notebook.

The data will be analyzed to answer the following questions:
1. Which countries have the most improved life expectancy
2. Which countries have the worst regression in life expectancy
3. World life expectancy trends over time
4. Does GDP correlate with life expectancy
5. How many developed vs developing countries are in the dataset
6. Are there any developed countries with less gdp than developing countries

In [19]:
%%sql
WITH CTE AS (
    SELECT 
        Country,
        Lifeexpectancy,
        `Year`,
        ROW_NUMBER() OVER (PARTITION BY Country ORDER BY `Year` ASC) AS rn_first,
        ROW_NUMBER() OVER (PARTITION BY Country ORDER BY `Year` DESC) AS rn_last
    FROM worldlifeexpectancy
)

SELECT
    first.Country,
    (last.Lifeexpectancy - first.Lifeexpectancy) AS life_expectancy_change,
    
    ROUND(
    (last.Lifeexpectancy - first.Lifeexpectancy) 
        - AVG(last.Lifeexpectancy - first.Lifeexpectancy) OVER (), 
    2) AS difference_from_avg,
    
    ABS(
    (last.Lifeexpectancy - first.Lifeexpectancy) 
        - AVG(last.Lifeexpectancy - first.Lifeexpectancy) OVER ()) 
    / STDDEV(last.Lifeexpectancy - first.Lifeexpectancy) OVER () AS z_score
FROM
    CTE AS first
JOIN 
    CTE AS last ON first.Country = last.Country
WHERE 
    first.rn_first = 1 AND last.rn_last = 1
ORDER BY life_expectancy_change DESC;

,Country,life_expectancy_change,difference_from_avg,z_score
0,Zimbabwe,21.0,16.13,3.820376
1,Eritrea,19.4,14.53,3.441495
2,Zambia,18.0,13.13,3.109975
3,Botswana,17.9,13.03,3.086295
4,Rwanda,17.8,12.93,3.062615
...,...,...,...,...
178,Yemen,-2.3,-7.17,1.697068
179,Paraguay,-5.0,-9.87,2.336428
180,Libya,-5.3,-10.17,2.407468
181,Saint Vincent and the Grenadines,-5.8,-10.67,2.525868
182,Syrian Arab Republic,-8.1,-12.97,3.070509

### Results, Most Improved Life Expectancy
Zimbabwe has the most improved life expectancy with a change of 21 years with a Zscore of 3.8. The development if Zimbabwe during this period should be studied to understand the factors that contributed to this improvement as a zscore of 3.8 is very high. Evert country in the top 10 has a zscore of 1.5 or higher meaning their changes are significantly different from the average change in life expectancy at alpha = 0.05.

In [20]:
%%sql
WITH CTE AS (
    SELECT 
        Country,
        Lifeexpectancy,
        `Year`,
        ROW_NUMBER() OVER (PARTITION BY Country ORDER BY `Year` ASC) AS rn_first,
        ROW_NUMBER() OVER (PARTITION BY Country ORDER BY `Year` DESC) AS rn_last
    FROM worldlifeexpectancy
)

SELECT
    first.Country,
    (last.Lifeexpectancy - first.Lifeexpectancy) AS life_expectancy_change,
    ROUND((last.Lifeexpectancy - first.Lifeexpectancy) - AVG(last.Lifeexpectancy - first.Lifeexpectancy) OVER (), 2) AS difference_from_avg,
    ABS((last.Lifeexpectancy - first.Lifeexpectancy) - AVG(last.Lifeexpectancy - first.Lifeexpectancy) OVER ()) / STDDEV(last.Lifeexpectancy - first.Lifeexpectancy) OVER () AS z_score
FROM
    CTE AS first
JOIN 
    CTE AS last ON first.Country = last.Country
WHERE 
    first.rn_first = 1 AND last.rn_last = 1
ORDER BY life_expectancy_change ASC;

,Country,life_expectancy_change,difference_from_avg,z_score
0,Syrian Arab Republic,-8.1,-12.97,3.070509
1,Saint Vincent and the Grenadines,-5.8,-10.67,2.525868
2,Libya,-5.3,-10.17,2.407468
3,Paraguay,-5.0,-9.87,2.336428
4,Yemen,-2.3,-7.17,1.697068
...,...,...,...,...
178,Rwanda,17.8,12.93,3.062615
179,Botswana,17.9,13.03,3.086295
180,Zambia,18.0,13.13,3.109975
181,Eritrea,19.4,14.53,3.441495
182,Zimbabwe,21.0,16.13,3.820376

### Results, Worst Regression in Life Expectancy

The data here is more interpretable due to recent events surrounding the post Arab Spring and wars in Syria amd the ongoing civil war in Yemen. 

In future analysis, it would be interesting to see the correlation between the change in life expectancy and the GDP of the country and look at changes in terms of percentage from original as opposed to raw numbers. COVID-19 data could also be added to see how the pandemic has affected life expectancy in different countries.

In [21]:
%%sql
SELECT 
    wle.`Year`,
    ROUND(AVG(wle.Lifeexpectancy), 2) AS avg_life_expectancy,
    ROUND(AVG(wle.Lifeexpectancy), 2) - ROUND(AVG(t2.Lifeexpectancy), 2) AS avg_le_change
FROM
    worldlifeexpectancy as wle
LEFT JOIN worldlifeexpectancy AS t2 ON  wle.`Year` = t2.`Year` + 1
GROUP BY `Year`

    Year  avg_life_expectancy  avg_le_change
0   2022                71.62           0.08
1   2021                71.54           0.30
2   2020                71.24           0.32
3   2019                70.92           0.27
4   2018                70.65           0.60
5   2017                70.05           0.11
6   2016                69.94           0.51
7   2015                69.43           0.39
8   2014                69.04           0.37
9   2013                68.67           0.46
10  2012                68.21           0.56
11  2011                67.65           0.22
12  2010                67.43           0.08
13  2009                67.35           0.22
14  2008                67.13           0.38
15  2007                66.75            NaN

### Results, World Life Expectancy Trends Over Time

The average world life expectancy is growing overall and at substantially variable rates

### Correlation Between GDP and Life Expectancy

MySQL doesn't have a built-in CORR() function to calculate correlation between two variables. This cell will be run in python to calculate the correlation between GDP and Life Expectancy. I am using an Anaconda base environment in Python 3.12 and had to install pymysql via `conda install pymysql` to connect to the MySQL database.

In [22]:
import pandas as pd
import pymysql 
import sqlalchemy as sql
from lxml.html.builder import SELECT

from mypassword import password, user
import warnings

warnings.filterwarnings('ignore') # a future warning is thrown by pandas

conn = sql.create_engine(f"mysql+pymysql://{user}:{password}@localhost/wle")
cursor = conn.connect()

query = """SELECT * FROM worldlifeexpectancy"""

df = pd.read_sql(query, conn)
all_correlation = round(df['Lifeexpectancy'].corr(df['GDP']),2)

print(f'The correlation between GDP and Life Expectancy is {all_correlation} for all data points present')

correl_df = pd.DataFrame(columns=['Year', 'Correlation'])
for year in df['Year'].sort_values().unique():
    year_df = df[df['Year'] == year]
    correlation = round(year_df['Lifeexpectancy'].corr(year_df['GDP']), 2)
    correl_df = pd.concat([correl_df, pd.DataFrame({'Year': [year], 'Correlation': [correlation]})], ignore_index=True)
    print(f'The correlation between GDP and Life Expectancy is {correlation} for the year {year}')
   
# convert to csv
correl_df.to_csv('gdp_year.csv', index=False)

# free up resources
cursor.close()
conn.dispose()

The correlation between GDP and Life Expectancy is 0.46 for all data points present
The correlation between GDP and Life Expectancy is 0.48 for the year 2007
The correlation between GDP and Life Expectancy is 0.5 for the year 2008
The correlation between GDP and Life Expectancy is 0.51 for the year 2009
The correlation between GDP and Life Expectancy is 0.48 for the year 2010
The correlation between GDP and Life Expectancy is 0.51 for the year 2011
The correlation between GDP and Life Expectancy is 0.49 for the year 2012
The correlation between GDP and Life Expectancy is 0.47 for the year 2013
The correlation between GDP and Life Expectancy is 0.48 for the year 2014
The correlation between GDP and Life Expectancy is 0.48 for the year 2015
The correlation between GDP and Life Expectancy is 0.45 for the year 2016
The correlation between GDP and Life Expectancy is 0.45 for the year 2017
The correlation between GDP and Life Expectancy is 0.47 for the year 2018
The correlation between GDP and Life Expectancy is 0.49 for the year 2019
The correlation between GDP and Life Expectancy is 0.44 for the year 2020
The correlation between GDP and Life Expectancy is 0.47 for the year 2021
The correlation between GDP and Life Expectancy is 0.47 for the year 2022

In [23]:
%%sql
CREATE TABLE IF NOT EXISTS gdp_year (
    YEAR INT NOT NULL PRIMARY KEY,
    GDP FLOAT NOT NULL
);

TRUNCATE TABLE gdp_year;

LOAD DATA LOCAL INFILE 'gdp_year.csv' INTO TABLE gdp_year
FIELDS TERMINATED BY ','
LINES TERMINATED BY '\n'
IGNORE 1 ROWS;

SELECT * FROM gdp_year;

    YEAR   GDP
0   2007  0.48
1   2008  0.50
2   2009  0.51
3   2010  0.48
4   2011  0.51
5   2012  0.49
6   2013  0.47
7   2014  0.48
8   2015  0.48
9   2016  0.45
10  2017  0.45
11  2018  0.47
12  2019  0.49
13  2020  0.44
14  2021  0.47
15  2022  0.47

### Results, Correlation Between GDP and Life Expectancy

With results between 0.39 and 0.47, the correlation is moderately positive between `GDP` and `Life Expectency`

In [24]:
%%sql
SELECT 
    SUM(CASE
        WHEN Status = 'Developed' THEN 1
        END) as num_developed,
    SUM(CASE
        WHEN Status = 'Developing' THEN 1
        END) as num_developing
FROM worldlifeexpectancy
WHERE `Year` = 2022;

   num_developed  num_developing
0             32             151

### Results, Developed vs Developing Countries

Most countries in the dataset are developing countries. I am unsure of the criteria for this and would recommend a read of criticisms of the term found [here](https://en.wikipedia.org/wiki/Developing_country#Criticisms_of_the_term).

In [25]:
%%sql
WITH least_developed_developed AS (
    SELECT 
        Country,
        GDP,
        Status
    FROM worldlifeexpectancy
    WHERE Status = 'Developed'
        AND `Year` = 2022
        AND GDP > 0
    ORDER BY GDP ASC
    LIMIT 1
),
    
MOST_developed_developing AS (
    SELECT 
        Country,
        GDP,
        Status
    FROM worldlifeexpectancy
    WHERE Status = 'Developing'
        AND `Year` = 2022
    ORDER BY GDP DESC
    LIMIT 1
)


SELECT * FROM least_developed_developed
UNION
SELECT * FROM MOST_developed_developing;

   Country    GDP      Status
0  Belgium  10000   Developed
1    Qatar  66347  Developing

### Results, Developed Countries with Less GDP than Developing Countries

It seems some of the data is still incorrect despite my attempt to scale. This discovery means that previous analysis will be incorrect. The data should be rechecked and cleaned. As this is a simple EDA, I will not be doing this here and ending the analysis.